tutorial/atmMapped/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xmax     1260;
xmin     -1260;
ymax     1020;
ymin     -1020;
zmax     180;
zmin     0;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 34 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Top
    {
        type patch;
        faces
        (
            (5 6 7 4)
        );
    }

    North
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    West
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    East
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    South
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    
);

mergePatchPairs
(
);

// ************************************************************************* //
