tutorial/atmMapped/0/ABLProp
zDir            (0 0 1);
Zref            30;     
z0              uniform 1;
d               uniform 0;