tutorial/atmMapped/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

kInlet          0.1;

internalField   uniform 0.1;

boundaryField
{
    "(North|West|South|East)"
    {
        // Mandatory entries (unmodifiable)
        type            atmBoundaryLayerMappedK;
        #include        "ABLProp";
    }

   
    Top
    {
        type            slip;
    }
    
    ground
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    Peiyang
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
