tutorial/atmMapped/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Simple.stl
{
    //#includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"

    extractionMethod extractFromSurface;  

    extractFromSurfaceCoeffs 
    {  
        includedAngle 120; 
    }  
    
    subsetFeatures 
    {  
        nonManifoldEdges yes; 
        openEdges yes; 
    }

    writeObj no;
}

// ************************************************************************* //
